УТ/src/InformationRegisters/ВходящиеПлатежныеСсылкиСБП/ВходящиеПлатежныеСсылкиСБП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВходящиеПлатежныеСсылкиСБП</name>
  <resources>
    <name>СуммаОперации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСсылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПодключения</name>
    <type>
      <types>CatalogRef.НастройкиПодключенияКСистемеБыстрыхПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаПройдена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОперации</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ТаможеннаяДекларацияИмпорт</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВыкупПринятыхНаХранениеТоваров</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</types>
      <types>DocumentRef.ОтчетКомитенту</types>
      <types>DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</types>
      <types>DocumentRef.КорректировкаПриобретения</types>
      <types>DocumentRef.ОтчетКомитентуОСписании</types>
      <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.ВыкупВозвратнойТарыУПоставщика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПлатежнаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств/СтатусыЗаявокНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаРасходованиеДенежныхСредств</name>
  <enumValues>
    <name>НеСогласована</name>
  </enumValues>
  <enumValues>
    <name>Согласована</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отложена</name>
  </enumValues>
</mdclass:Enum>

УТ/src/CommonForms/ВводВходящейПлатежнойСсылкиСБП/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Документ = Параметры.Документ;
	ПлатежнаяСсылка = Параметры.ПлатежнаяСсылка;
	ИсходнаяПлатежнаяСсылка = Параметры.ПлатежнаяСсылка;
	НастройкаПодключения = Параметры.НастройкаПодключения;
	Контрагент = Параметры.Контрагент;
	БанковскийСчетКонтрагента = Параметры.БанковскийСчетКонтрагента;
	
	ЭтоПлатежныйДокумент = ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств");
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИНН");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
		НомерСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БанковскийСчетКонтрагента, "НомерСчета");
	КонецЕсли;
	
	ДанныеНастройки = СистемаБыстрыхПлатежейУТ.ДанныеНастройкиПодключения(НастройкаПодключения);
	
	Организация = ДанныеНастройки.Организация;
	БанковскийСчетОрганизации = ДанныеНастройки.БанковскийСчет;
	
	Если ЭтоПлатежныйДокумент Тогда
		
		Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "Статус");
		КОплате = Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
		
	КонецЕсли;
	
	ПоказатьКартинку();
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежнаяСсылкаПриИзменении(Элемент)
	
	ПлатежнаяСсылкаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		
		Если КОплате Тогда
			Закрыть(Неопределено);
			Возврат;
		КонецЕсли;
		
		Если ИсходнаяПлатежнаяСсылка = ПлатежнаяСсылка Тогда
			Закрыть(Неопределено);
			Возврат;
		КонецЕсли;
		
		ОповещениеОПолученииДанныхЗаполнения = Новый ОписаниеОповещения("ПроверитьПлатежнуюСсылку", ЭтотОбъект);
		СистемаБыстрыхПлатежейУТКлиент.ПолучитьДанныеЗаполненияПоПлатежнойСсылке(
			ЭтотОбъект, НастройкаПодключения, ПлатежнаяСсылка, ОповещениеОПолученииДанныхЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()

	Заголовок = ?(КОплате, НСтр("ru = 'QR-код'"), НСтр("ru = 'Ввод платежной ссылки'"));
	Элементы.АдресКартинки.Видимость = КОплате;
	Элементы.ПлатежнаяСсылка.ТолькоПросмотр = КОплате;

КонецПроцедуры

&НаСервере
Процедура ПлатежнаяСсылкаПриИзмененииНаСервере()

	ПоказатьКартинку();
	УправлениеЭлементамиФормы();

КонецПроцедуры

&НаСервере
Процедура ПоказатьКартинку()

	Если КОплате Тогда
		
		Элементы.ДекорацияПредупреждение.Заголовок = "";
		
		Если ЗначениеЗаполнено(ПлатежнаяСсылка) Тогда
			
			Результат = ПереводыСБПb2b.ДанныеФункциональнойСсылки(ПлатежнаяСсылка, НастройкаПодключения);
			ДвоичныеДанные = СистемаБыстрыхПлатежей.ИзображениеQRКодаСБП(ПлатежнаяСсылка, 150);
			АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			
			Если ЗначениеЗаполнено(Результат.КодОшибки) Тогда
				Элементы.ДекорацияПредупреждение.Заголовок = Результат.СообщениеОбОшибке;
			Иначе
				
				ДанныеСсылки = Результат.ДанныеСсылки;
				
				Если ДанныеСсылки.ИНН <> ИНН
					Или (ДанныеСсылки.СчетПолучателя <> НомерСчета
					И Не ПустаяСтрока(НомерСчета))Тогда
					Элементы.ДекорацияПредупреждение.Заголовок = 
						СтрШаблон(НСтр("ru = 'Реквизиты получателя платежа, указанные в платежной ссылке, не соответствуют данным получателя в документе.
										|Получатель платежа СБП: ИНН - %1 , счет - %2'"),
						ДанныеСсылки.ИНН,
						ДанныеСсылки.СчетПолучателя);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПлатежнуюСсылку(Результат, ДополнительныеПараметры) Экспорт

	ДанныеПлатежнойСсылки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Для Каждого Сообщение Из Результат.Сообщения Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение.Текст);
	КонецЦикла;
	
	Если ДанныеПлатежнойСсылки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПлатежнойСсылки.КодОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеПлатежнойСсылки.СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверки = ДенежныеСредстваКлиентСерверЛокализация.ПараметрыПроверкиПолучателяПлатежнойСсылки();
	ПараметрыПроверки.ИНН = ИНН;
	ПараметрыПроверки.НомерСчета = НомерСчета;
	
	Если Не ДенежныеСредстваКлиентСерверЛокализация.ПолучательПлатежнойСсылкиСоответствуетДокументу(ПараметрыПроверки, ДанныеПлатежнойСсылки) Тогда
		
		ТекстПредупреждения = СтрШаблон(
			НСтр("ru = 'Реквизиты получателя платежа, указанные в платежной ссылке, не соответствуют данным получателя в документе.
						|Получатель платежа СБП: ИНН - %1 , счет - %2'"),
			ДанныеПлатежнойСсылки.ИНН,
			ДанныеПлатежнойСсылки.СчетПолучателя);
		ЗаголовокПредупреждения = НСтр("ru = 'Проверка данных получателя платежа'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , ЗаголовокПредупреждения);
		
	Иначе
		
		Если ЭтоПлатежныйДокумент Тогда
			Успешно = ПроверитьПлатежнуюСсылкуПлатежногоДокумента(ДанныеПлатежнойСсылки);
		Иначе
			Успешно = ЗаписьПлатежнойСсылки(ДанныеПлатежнойСсылки);
		КонецЕсли;
		
		Если Успешно Тогда
			Закрыть(ДанныеПлатежнойСсылки);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗаписьПлатежнойСсылки(ПараметрыЗаписи)

	Если ПараметрыЗаписи.ТипСсылки = "02" Тогда
		
		НаборЗаписей = РегистрыСведений.ВходящиеПлатежныеСсылкиСБП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПлатежнаяСсылка.Установить(ПлатежнаяСсылка);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Платежная ссылка уже привязана к документу %1'"), Запись.ДокументОперации);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
			
		КонецЦикла;
		
	КонецЕсли;
	
	РегистрыСведений.ВходящиеПлатежныеСсылкиСБП.ЗаписатьПлатежнуюСсылку(
		Документ, ПараметрыЗаписи);
	Возврат Истина;

КонецФункции

&НаСервере
Функция ПроверитьПлатежнуюСсылкуПлатежногоДокумента(ДанныеПлатежнойСсылки)

	Ошибка = Ложь;
	
	Если ДанныеПлатежнойСсылки.ТипСсылки = "02" Тогда
		ЗаявкаНаРасходованиеДенежныхСредствЛокализация.ПроверитьИспользованиеПлатежнойСсылкиВЗаявках(Документ, ПлатежнаяСсылка, Ошибка);
	КонецЕсли;
	
	Возврат Не Ошибка;

КонецФункции

#КонецОбласти
